class Main {
    /*
     * 문제에서 요구한 스타워즈 로고를 줄 단위 문자열로 출력한다.
     * 공백과 특수문자의 위치를 그대로 유지한다.
     */
    public static void main(String[] args){
        System.out.print("    8888888888  888    88888\n   88     88   88 88   88  88\n    8888  88  88   88  88888\n       88 88 888888888 88   88\n88888888  88 88     88 88    888888\n\n88  88  88   888    88888    888888\n88  88  88  88 88   88  88  88\n88 8888 88 88   88  88888    8888\n 888  888 888888888 88  88      88\n  88  88  88     88 88   88888888");
    }
}
